samplepayload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.test.edjusted.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:processEvent/>
    </soapenv:Body>
</soapenv:Envelope>